app/Controllers/Api.php

    public function addCart()
    {

        try {

            $token = $_POST['token'];
            $product_id = $_POST['product_id'];
            $qty = $_POST['qty'];

            $user_model = new user_model();

            $userdata = $user_model->where([
                'token' => $token,
                'is_deleted' => 0,
            ])->first();

            if (empty($userdata)) {
                throw new \Exception("invalid token");
            }

            $product_model = new product_model();

            $productData = $product_model->where([
                'product_id' => $product_id,
                'is_deleted' => 0,
            ])->first();
---
SELECT *
FROM `user`
WHERE `token` = '719aff12d20c0553543f1acbd1bb59d4'
AND `is_deleted` = 0
 LIMIT 1
SELECT *
FROM `product`
WHERE `product_id` = '3'
AND `is_deleted` = 0
 LIMIT 1

            }

            $cart_model = new cart_model();
            $cart_model->insert([
                'user_id' => $userdata['user_id'],
                'product_id' => $product_id,
                'qty' => $qty,
                'price' => $productData['price'],
                'created_date' => date("Y-m-d H:i:s")
            ]);
---
INSERT INTO `cart` (`user_id`, `product_id`, `qty`, `price`, `created_date`) VALUES ('1', '3', '1', '8.00', '2024-02-22 11:47:51')

    public function getCart($token)
    {

        try {

            $user_model = new User_model();
            $userdata = $user_model->where([
                'token' => $token,
                'is_deleted' => 0,
            ])->first();

            if (empty($userdata)) {
                throw new \Exception("invalid token");
            }

            $cart_model = new Cart_model();
            $cartList = $cart_model->where([
                'user_id' => $userdata['user_id'],
                'is_deleted' => 0,
            ])->findAll();
---
SELECT *
FROM `user`
WHERE `token` = 'eb0c1677015c82b2dedbc896808a8695'
AND `is_deleted` = 0
 LIMIT 1
SELECT *
FROM `cart`
WHERE `user_id` = '1'
AND `is_deleted` = 0