app/Controllers/Backend.php

    public function product_manage()
    {

        $productmodel = new product_model();
        $productlist = $productmodel->where(["is_deleted" => 0])->findAll();
---
SELECT *
FROM `product`
WHERE `is_deleted` = 0

    public function user_manage(){
        $usermodel = new user_model();
        $userlist = $usermodel->where(["is_deleted" => 0])->findAll();
---
SELECT *
FROM `user`
WHERE `is_deleted` = 0

    public function so_insert()
    {
        $user_id = $_POST['user_id'];
        $firstname = $_POST['firstname'];
        $serial = $_POST['serial'];
        $total_amount = $_POST['total_amount'];
        $remarks = $_POST['remarks'];
        $lastname = $_POST['lastname'];
        $Email = $_POST['Email'];
        $phone = $_POST['phone'];
        $country = $_POST['country'];
        $City = $_POST['City'];
        $Postcode = $_POST['Postcode'];
        $Address1 = $_POST['Address1'];
        $Address2 = $_POST['Address2'];



        $so_model = new salesorder_model();
        $so_model->insert([
            'user_id' => $user_id,
            'serial' => $serial,
            'total_amount' => $total_amount,
            'shipping_firstname' => $firstname,
            'shipping_lastname' => $lastname,
            'shipping_phone' => $phone,
            'shipping_email' => $Email,
            'shipping_add1' => $Address1,
            'shipping_add2' => $Address2,
            'shipping_city' => $City,
            'shipping_zip' => $Postcode,
            'remarks' => $remarks,
            'shipping_country' => $country,
            'created_date' => date("Y-m-d H:i:s")
        ]);
---
INSERT INTO `sales_order` (`user_id`, `serial`, `total_amount`, `shipping_firstname`, `shipping_lastname`, `shipping_phone`, `shipping_email`, `shipping_add1`, `shipping_add2`, `shipping_city`, `shipping_zip`, `remarks`, `shipping_country`, `created_date`) VALUES ('123', 'kjsdfhkj12', '11', 'asd', 'asd', '01122002121', 'kasjdn@gmail.com', 'jalan', 'halan', 'Johor', '20000', 'asd', 'Malaysia', '2023-09-15 07:00:31')