app/Controllers/checkout.php

SELECT *
FROM `user`
WHERE `token` = 'eb0c1677015c82b2dedbc896808a8695'
AND `is_deleted` = 0
 LIMIT 1
INSERT INTO `sales_order` (`user_id`, `shipping_firstname`, `shipping_lastname`, `shipping_email`, `shipping_phone`, `remarks`, `shipping_country`, `shipping_zip`, `shipping_add1`, `shipping_add2`, `total_amount`, `serial`, `created_date`) VALUES ('1', 'waaww', 'wawa', 'wawa@gmail.com', '01546465', 'wawa', 'Malaysia', '5000', 'jaan', 'aksd', 0, '20230915073035', '2023-09-15 07:30:35')
---
    public function checkout_submit()
    {
        $usermodel = new user_model();
        $userdata = $usermodel->where([
            'token' => $this->data['token'],
            'is_deleted' => 0,
        ])->first();

        if (empty($userdata)) {
            throw new \Exception("invalid token");
        }


        $firstname = $_POST['firstname'];
        $lastname = $_POST['lastname'];
        $email = $_POST['Email'];
        $phone = $_POST['Phone'];
        $remarks = $_POST['remarks'];
        $country = $_POST['country'];
        $City = $_POST['City'];
        $Postcode = $_POST['Postcode'];
        $Address1 = $_POST['Address1'];
        $Address2 = $_POST['Address2'];

        $serial = date('Ymdhis');
        $salesorder = new salesorder_model();
        $so_id = $salesorder->insert([
            'user_id' => $userdata['user_id'],
            'shipping_firstname' => $firstname,
            'shipping_lastname' => $lastname,
            'shipping_email' => $email,
            'shipping_phone' => $phone,
            'remarks' => $remarks,
            'shipping_country' => $country,
            'shipping_city	' => $City,
            'shipping_zip' => $Postcode,
            'shipping_add1' => $Address1,
            'shipping_add2' => $Address2,
            'total_amount' => 0,
            'serial' => $serial,
            'created_date' => date("Y-m-d H:i:s"),

        ]);

SELECT *
FROM `cart`
WHERE `user_id` = '1'
AND `is_deleted` = 0
---
        $sod_model = new salesorder_detail_model();

        $cartmodel = new cart_model();
        $cartlist = $cartmodel->where([
            'user_id' => $userdata['user_id'],
            'is_deleted' => 0
        ])->findAll();

SELECT *
FROM `product`
WHERE `product_id` = '2'
AND `is_deleted` = 0
 LIMIT 1
---
        foreach ($cartlist as $k => $v) {
            $total_amount += $v['qty'] * $v['price'];

            $productdata =  $productmodel->where([
                'product_id' => $v['product_id'],
                'is_deleted' => 0
            ])->first();

UPDATE `cart` SET `is_deleted` = 1, `modified_date` = '2023-09-15 07:30:35'
WHERE `cart`.`cart_id` IN ('11')
UPDATE `sales_order` SET `total_amount` = 27, `modified_date` = '2023-09-15 07:30:35'
WHERE `sales_order`.`so_id` IN (16)
---
                'created_date'  => date("Y-m-d H:i:s")
            ]);

            $cartmodel->update($v['cart_id'], [
                'is_deleted' => 1,
                'modified_date' => date('Y-m-d H:i:s')
            ]);
        }

       $salesorder->update($so_id,[
            'total_amount'=>$total_amount,
            'modified_date' => date('Y-m-d H:i:s')

        ]);