app/Controllers/product.php

SELECT *
FROM `product`
WHERE `is_deleted` = 0
---
    public function productList()
    {
        $productmodel = new product_model();
        $productList = $productmodel->where(["is_deleted" => 0])->findAll();

SELECT *
FROM `product`
WHERE `product_id` = '2'
 LIMIT 1
---
    public function product($product_id)
    {
        $productmodel =  new product_model();
        $single_product = $productmodel->where(["product_id" => $product_id])->first();

SELECT *
FROM `user`
WHERE `token` = '1c2a144c43c3162ef5c71f8facf72604'
AND `is_deleted` = 0
 LIMIT 1
SELECT *
FROM `cart`
WHERE `user_id` = '2'
AND `is_deleted` = 0
---
    public function cart()
    {

        $user_model = new user_model();

        $userdata = $user_model->where([
            'token' => $this->data['token'],
            'is_deleted' => 0,
        ])->first();

        if (empty($userdata)) {
            throw new \Exception("invalid token");
        }

        $cart_model = new cart_model();

        $cartList = $cart_model->where([
            'user_id' => $userdata['user_id'],
            'is_deleted' => 0,
        ])->findAll();