app/Controllers/product.php

    public function productList()
    {
        $productmodel = new product_model();
        $productList = $productmodel->findAll();
---
SELECT *
FROM `product`